package Sem6;
// 1. Описать класс для работы с бинарным деревом  
// 1.1 Реализовать три варианта обхода - ru.wikipedia.org/wiki/Обход_дерева#Прямой_обход_(NLR)
// 1.2 Сделать скобочную запись бинарного дерева

public class drevo {
    /*Вот вроде бы понятно, как это должно выглядеть:
     * Каждый элемент связан с двумя другими лементами из которых левый больше, а правый меньше
     * Если дочернего лемента нет на его место можно записать null
     * Но как это в коде я не понимаю
     */

    class Node {
        private int value; /*Тут объявили узел и его наследников */
        private Node leftChild;
        private Node rightChild; 
// иииии и на этом понятное кончилось.
    }
}
